{
    "olist_customers_dataset": [
        "Table containing customer information including unique identifiers and location details.",
        [
            [
                "customer_id: Unique identifier for each customer, sample values: '5cc2000a02011f09463e935d6f33ea6d', 'bc8bc13c6748cdaa83178cdf94ba57a9'"
            ],
            [
                "customer_unique_id: Unique identifier for each customer allowing identification of repurchases, sample values: '9280630f31756d3c7a7abe695a723d09', '3d18156a1dff6d57e215431e45574371'"
            ],
            [
                "customer_zip_code_prefix: Numeric prefix of customer's ZIP code, sample values: 63680, 7054"
            ],
            [
                "customer_city: City where the customer is located, sample values: 'parambu', 'guarulhos'"
            ],
            [
                "customer_state: State where the customer is located, sample values: 'CE', 'SP'"
            ]
        ]
    ],
    "olist_geolocation_dataset": [
        "Table containing Brazilian zip codes and their corresponding lat/lng coordinates used for mapping and distance calculations.",
        [
            [
                "geolocation_zip_code_prefix: The prefix of Brazilian zip codes, sample values: 7153, 39827"
            ],
            [
                "geolocation_lat: The latitude coordinates associated with the zip codes, sample values: -23.38152125007212, -17.809487323773734"
            ],
            [
                "geolocation_lng: The longitude coordinates associated with the zip codes, sample values: -46.44659355828381, -41.78475993625214"
            ],
            [
                "geolocation_city: The city names corresponding to the zip codes, sample values: 'guarulhos', 'pote'"
            ],
            [
                "geolocation_state: The state codes (e.g., SP for Sao Paulo) associated with the zip codes, sample values: 'SP', 'MG'"
            ]
        ]
    ],
    "olist_order_items_dataset": [
        "Table containing data about the items purchased within each Olist order.",
        [
            [
                "order_id: unique identifier for each order, sample values: '9d0f89ac7841fe621cb103d22838fb80', '05e2ab8de37670d9d0524473585092ec'"
            ],
            [
                "order_item_id: identifier for each item in an order, sample values: 1, 2"
            ],
            [
                "product_id: unique identifier for each product, sample values: '0f2c1048222e26ef6d48bed2dc676a9b', 'd1c427060a0f73f6b889a5c7c61f2ac4'"
            ],
            [
                "seller_id: unique identifier for each seller, sample values: '0dfbed20065e425d2eaefb101f9816c0', 'a1043bafd471dff536d0c462352beb48'"
            ],
            [
                "shipping_limit_date: date and time limit for shipping the item, sample values: '2018-05-16 23:30:47', '2017-12-04 03:23:37'"
            ],
            [
                "price: price of the item, sample values: 25.18, 149.99"
            ],
            [
                "freight_value: shipping cost of the item, sample values: 12.79, 23.85"
            ]
        ]
    ],
    "olist_order_payments_dataset": [
        "Table containing data about the orders payment options.",
        [
            [
                "order_id: unique identifier for each order, sample values: 'ebe8e5e35f85b19e3b8132a054bbf523', '51efa345a1180ca3879442a31b0a265a'"
            ],
            [
                "payment_sequential: sequential number for each payment within an order, sample values: 1, 2"
            ],
            [
                "payment_type: type of payment chosen for the order, sample values: 'credit_card', 'voucher'"
            ],
            [
                "payment_installments: number of installments for the payment, sample values: 6, 1"
            ],
            [
                "payment_value: value of the payment made, sample values: 123.89, 194.88"
            ]
        ]
    ],
    "olist_order_reviews_dataset": [
        "Table containing data about customer reviews post purchase.",
        [
            [
                "review_id: Unique identifier for each review, sample values: 'bdc146f5b687a560130d8f312b4d8b3c', 'ec2f5c6e053a85e84301b3369f79ef8c'"
            ],
            [
                "order_id: Unique identifier for each order associated with the review, sample values: '9f3f85ddc354be372be6cde53a577cd5', 'b56bcbb57a9be94114e2dfb18399193e'"
            ],
            [
                "review_score: The rating score given in the review, sample values: 5, 4"
            ],
            [
                "review_comment_title: Title of the comment in the review, may be NULL, sample values: None"
            ],
            [
                "review_comment_message: Additional detailed message in the review comment, sample values: 'Chegou no Prazo!! Ameeei a encomenda', 'Não havia identificado que o produto não era elétrico...'"
            ],
            [
                "review_creation_date: Date and time when the review was created, sample values: '2017-07-13 00:00:00', '2018-08-04 00:00:00'"
            ],
            [
                "review_answer_timestamp: Timestamp of when the review was answered, sample values: '2017-07-13 19:25:34', '2018-08-04 19:50:33'"
            ]
        ]
    ],
    "olist_orders_dataset": [
        "Table containing order-level details for Olist e-commerce platform.",
        [
            [
                "order_id: Unique identifier for each order, sample values: 'cd1afe54001178b012be992f11234a8e', '4899eb30202787ac652e0c9d9f690edb'"
            ],
            [
                "customer_id: Unique identifier for each customer placing the order, sample values: 'd30553b51b521018932b96d1eb08d678', '2586a9c3d898a19110c726babb5ab170'"
            ],
            [
                "order_status: Status of the order, sample values: 'delivered', 'delivered'"
            ],
            [
                "order_purchase_timestamp: Timestamp when the order was purchased, sample values: '2017-12-11 18:24:33', '2018-05-02 18:06:48'"
            ],
            [
                "order_approved_at: Timestamp when the order was approved, sample values: '2017-12-11 18:36:25', '2018-05-02 18:58:19'"
            ],
            [
                "order_delivered_carrier_date: Timestamp when the order was handed to the carrier, sample values: '2017-12-14 00:23:47', '2018-05-04 14:55:00'"
            ],
            [
                "order_delivered_customer_date: Timestamp when the order was delivered to the customer, sample values: '2017-12-15 21:48:31', '2018-05-15 00:41:42'"
            ],
            [
                "order_estimated_delivery_date: Estimated delivery date for the order, sample values: '2017-12-28 00:00:00', '2018-05-28 00:00:00'"
            ]
        ]
    ],
    "olist_products_dataset": [
        "Table containing data about products sold by Olist.",
        [
            [
                "product_id: unique identifier for each product, sample values: '21c0985594816cf11cf7cfc0631f6f1f', 'bea920589ef5e1949b4627e0574b877b'"
            ],
            [
                "product_category_name: category name of the product, may contain null values, sample values: 'moveis_decoracao', 'utilidades_domesticas'"
            ],
            [
                "product_name_lenght: length of the product name, sample values: 34.0, 41.0"
            ],
            [
                "product_description_lenght: length of the product description, may contain null values, sample values: 569.0, 356.0"
            ],
            [
                "product_photos_qty: quantity of photos for the product, may contain null values, sample values: 1.0, 3.0"
            ],
            [
                "product_weight_g: weight of the product in grams, sample values: 800.0, 200.0"
            ],
            [
                "product_length_cm: length of the product in centimeters, sample values: 30.0, 20.0"
            ],
            [
                "product_height_cm: height of the product in centimeters, sample values: 30.0, 10.0"
            ],
            [
                "product_width_cm: width of the product in centimeters, sample values: 30.0, 16.0"
            ]
        ]
    ],
    "olist_sellers_dataset": [
        "Table contains data about sellers fulfilling orders at Olist.",
        [
            [
                "seller_id: unique identifier for each seller, sample values: '404e1ba01358af4cd63f679b2c4d1fa1', '712efd3b68f9686dc856b84abd0f21ae'"
            ],
            [
                "seller_zip_code_prefix: the first part of seller's zip code, sample values: 36032, 82130"
            ],
            [
                "seller_city: city where the seller is located, sample values: 'juiz de fora', 'curitiba'"
            ],
            [
                "seller_state: state where the seller is located, sample values: 'MG', 'PR'"
            ]
        ]
    ],
    "product_category_name_translation": [
        "Table containing translated product category names from Portuguese to English.",
        [
            [
                "product_category_name: Original product category name in Portuguese, sample values: moveis_colchao_e_estofado, fashion_calcados"
            ],
            [
                "product_category_name_english: Translated product category name in English, sample values: furniture_mattress_and_upholstery, fashion_shoes"
            ]
        ]
    ]
}